//=============================================================================
// kaeru.js
//=============================================================================
/*:ja
 * @plugindesc kaeru
 * @author かえるぴょこぴょこ
 * @help 
 呪文を唱えるには長い詠唱を行わなくてはなりません。
 しかし、長い呪文を唱えるのは大変です。
 私はそれを短くしたいと思いました。
 それはとても困難で難しいことです。
 何故ならば、飛ばして良い呪文は存在しないのです。
 ですから、呪文を省略することを諦めました。
 一体どうすれば、良いのだろうか?
 その答えを見つけるために修業に励みました。
 来る日も来る日も……。
 そして、一つの答えを見つけました。
 呪文を早く唱えれば良いと言う実にシンプルな方法でした。
 しかし、それは過酷で困難でした。
 
 という事があり、呪文を取り敢えず先に唱えておく事で解決することにしました。
 何を望みますか?
 配列、ハッシュですか?
 例えばアクター
 <メタ名;[1,2,3]>
 とメモ欄に表記することで、this.actor().meta.メタ名で配列情報が獲得できるのです。
 
 とても有益ではないでしょうか?
 それは:コロンではなく、;セミコロンで区切るだけの簡単なお仕事です。
 
 理解できましたでしょうか?
 難しいと思っても頑張れば出来ます。
 何故ならば、貴方は魔法使いを目指すものなのですから、
 この程度のことは簡単に解るはずです。
 
 
 */
(function() {
	//
	// カエル泳ぎが上手くなる呪文
	//
	DataManager.extractMetadata = function(data) {
		//	セミがヤバイ
	    var re = /<([^<>:;]+)([:;]?)([^>]*)>/g;
	    data.meta = {};
	    // ウロボロスだ注意しろ!!
	    for (;;) {
	        var match = re.exec(data.note);
	        if (match) {
	            if (match[2] === ':') {
	            	// 低俗な言語(笑
	                data.meta[match[1]] = match[3];
	            } else if (match[2] === ';') {
	            	// 高級言語による呪文詠唱を行う。
	            	data.meta[match[1]] = JSON.parse(match[3]);
	            } else {
	            	// 祈りを捧げよ! 
	                data.meta[match[1]] = true;
	            }
	        } else {
	        	// やばい神の怒りに触れた!!
	            break;
	        }
	    }
	};



})();
